IDEA Open Model
CrossSectionGeneralColdFormed.Thickness Property
Compatible with IDEA StatiCa v 10.1
 Thickness of thin wall cross-section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public double Thickness { get; set; }
Public Property Thickness As Double
	Get
	Set
public:
property double Thickness {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
CrossSectionGeneralColdFormed Class
IdeaRS.OpenModel.CrossSection Namespace